app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "gituploadss"], ["body", "jdfkjskfdalsdjflkasjdfklajsdfff"], ["updated_at", "2020-02-18 05:36:21.655841"], ["id", 22]]
---
    def update
        @article = Article.find(params[:id])
        @article.update(article_params)